<?php 
#константы

$num_imns = array (	"0"=>"all",
					"1"=>"301",
					"2"=>"305",
					"3"=>"306",
					"4"=>"313",
					"5"=>"314",
					"6"=>"315",
					"7"=>"351",
					"8"=>"351",
					"9"=>"362",
					"10"=>"363",
					"11"=>"364"
);

$user_title = 	array(
						"fio"=>'(с заглавной буквы, русские символы. Пример: "Иванов Иван Иванович")',
						"unit"=>'(русские символы. Пример: "отдел по работе с плательщиками по Шарковщинскому району")',
						"job"=>'(указать маленькими буквами, без сокращений, без названия отдела. Пример: "начальник управления")',
						"telefon"=>'(только цифры. Пример: "80212457845")',	
						"ip"=>'(Пример: "10.33.0.0")',
						"comp_name"=>'Имя компьютера (Пример: 301 - 301 - 3001)',
						"ad_login"=>'Логин Active Directory (Пример: 301_Ivanov_A_A)'
					);
					
$fild_title =	array(
						"login"=>'Логин информационного ресурса',
						"date_from"=>'Дата предоставления',
						"date_to"=>'Дата прекращения',
						"state"=>'Статус',
						"request"=>'',
						"notice"=>'Примечание'
					);		

$fild_state = array("выгружен на область","отправлен в МНС", "действующий", "прекращен", "отказано");
$request_state = array("предоставление", "прекращение", "продление", "разблокировка", "изменить реквизиты");	
$job_state = array("администратор сетей","ведущий администратор баз данных","ведущий администратор сетей","ведущий бухгалтер","ведущий референт",
"ведущий специалист по сопровождению программного обеспечения","главный бухгалтер","главный бухгалтер - заведующий группой","главный государственный налоговый инспектор",
"главный специалист","главный специалист по кадрам","главный юрисконсульт","заведующий группой","заведующий сектором","заместитель начальника инспекции","заместитель начальника инспекции - начальник отдела",
"заместитель начальника инспекции - начальник управления","заместитель начальника отдела","заместитель начальника службы","заместитель начальника управления",
"заместитель начальника управления - начальник отдела","начальник инспекции","начальник отдела","начальник отделения","начальник службы","начальник управления","первый заместитель начальника инспекции",
"референт","секретарь приёмной","старший государственный налоговый инспектор","старший инспектор");				


function transliteration($word){
$transU = array(
								"А"=>"A", "Б"=>"B", "В"=>"V", "Г"=>"G", "Д"=>"D", "Е"=>"E", "Ё"=>"E", "Ж"=>"ZH", "З"=>"Z", "И"=>"I", "Й"=>"I", 
								"К"=>"K", "Л"=>"L", "М"=>"M", "Н"=>"N", "О"=>"O", "П"=>"P", "Р"=>"R", "С"=>"S", "Т"=>"T", "У"=>"U", "Ф"=>"F", 
								"Х"=>"KH", "Ц"=>"TS", "Ч"=>"CH", "Ш"=>"SH", "Щ"=>"SHCH", "Ы"=>"Y", "Ь"=>"", "Ъ"=>"IE", "Э"=>"E", "Ю"=>"IU", "Я"=>"IA");
$transL = array(
								"А"=>"a", "Б"=>"b", "В"=>"v", "Г"=>"g", "Д"=>"d", "Е"=>"e", "Ё"=>"e", "Ж"=>"zh", "З"=>"z", "И"=>"i", "Й"=>"i", 
								"К"=>"k", "Л"=>"l", "М"=>"m", "Н"=>"n", "О"=>"o", "П"=>"p", "Р"=>"r", "С"=>"s", "Т"=>"t", "У"=>"u", "Ф"=>"f", 
								"Х"=>"kh", "Ц"=>"ts", "Ч"=>"ch", "Ш"=>"sh", "Щ"=>"shch", "Ы"=>"y", "Ь"=>"", "Ъ"=>"ie", "Э"=>"e", "Ю"=>"iu", "Я"=>"ia");	
	
	$bufword = mb_strtoupper($word);
	$bufword = str_replace(" ","",$bufword);
	$bufword = trim($bufword);
	
	$newword = "";
	$newword = strtr($bufword,$transU);
	
	return $newword;
}

?>